---
kind: other
id: Properties.T:Autodesk.Revit.DB.FailureDefinitionAccessor
source: html/cccc6f66-1ba2-866a-4abe-ae40d3c628e2.htm
---
# FailureDefinitionAccessor Properties

Specifies whether the .NET object represents a valid Revit entity.